{
  "Items": [
    "Сегодня наблюдал на углу О*** и И*** восхитительный баннер. Огромными буквами: МЕДИЦИНСКАЯ КОМИССИЯ. Ниже мелким шрифтом перечисление всех справок, которые это комиссия выдает. А внизу, занимая четверть поля баннера, в полном соответствии с требованиями к рекламе медицинских услуг, предупреждение: ИМЕЮТСЯ ПРОТИВОПОКАЗАНИЯ. НЕОБХОДИМА КОНСУЛЬТАЦИЯ СПЕЦИАЛИСТА. Много думал о рекурсии и о том, что не все комиссии одинаково полезны <img src=\"https://www.inoreader.com/b/1438160281/1007947455\" style=\"position:absolute; visibility:hidden\">",
    "xxx: Димон, бекапы есть?<br>yyy: Если пришел отдел К, то ешь. <img src=\"https://www.inoreader.com/b/1438160281/1007947455\" style=\"position:absolute; visibility:hidden\">",
    "На гиктаймс:<br><br>xxx: Тяжело жить без мозга, наверное.<br>yyy: Это как умер. Окружающим тяжело, но самому человеку в общем-то все равно. <img src=\"https://www.inoreader.com/b/1438160281/1007947455\" style=\"position:absolute; visibility:hidden\">",
    "xxx: \"У меня не включается компьютер. Я снял крышку, внутри какие-то микросхемы и мертвый паук. Нужно купить нового паука? Я просто не разбираюсь.\"<br>ххх: Порадовало)<br>yyy: А если при замене пыль повредишь?<br>yyy: при замене паука<br>xxx: там еще нужно знать модель паука. Вдруг новый не совместим со старой паутиной будет?<br>yyy: Говорят, что японские пауки сильно греются и много кушают.<br>xxx: Блин. А один мой знакомый (он лучше меня разбирается) говорил, что можно и таракана, только придется самому на него кусок паутины намотать. А в остальном все также будет работать. Даже плюсы есть - к питанию неприхотлив, и почти не греется.<br>xxx: Только я боюсь сам лезть. Вдруг и правда пыль поврежу?.. Или не на ту лапку паутину намотаю... <img src=\"https://www.inoreader.com/b/1438160281/1007947455\" style=\"position:absolute; visibility:hidden\">",
    "Olha Karpenko: Специалист по игровой экономике Valve теперь министр финансов Греции<br>Olha Karpenko: я правда не помню, где в играх валв была экономика) самые их популярные - это контра, лефт фор дед и халф лайф. там вся механика - или ударить или сильно ударить<br>Timur Vorona: в контре была очень продуманная экономика<br>Timur Vorona: за убийства получаешь бабло, тратишь его на оружие<br>Timur Vorona: в Греции так же будет?) <img src=\"https://www.inoreader.com/b/1438160281/1007947455\" style=\"position:absolute; visibility:hidden\">",
    "Беседа в фейсбуке про новый белорусский налог на долги:<br><br>ХХХХ: Остро нужен налог на налоги. Кто больше платит налогов, тот больше платит налог с налогов. Рекурсия! С асимптотическим приближением к разорению.<br>ХХХХ: Налог на роды и налог на аборты! С одновременным изъятием из продажи контрацептивов!<br>YYYY: Ну это кстати тема не новая совсем<br>YYYY: Все уже описано в Чипполино.<br>XXXX: Налог на упоминание Чиполлино! В Чиполлино не было такого налога!<br>YYYY: Ты победил. Налог на победу уплати!<br>XXXX: Ты проиграл. Нутыпонял ) <img src=\"https://www.inoreader.com/b/1438160281/1007947455\" style=\"position:absolute; visibility:hidden\">",
    "xxx:<br>просыпаюсь утром от какого-то непонятного шороха. Внимательно осматриваю комнату и обнаруживаю источник звука: под столом мышь пытается просунуть морду в бутылку с остатками питьевого йогурта и, прихватывая бутылку за горлышко зубами, тянет ее потихоньку в угол. Вроде бы, обычная картина для частного, пусть и благоустроенного дома, если бы не один нюанс - в доме постоянно живут 18 (!) кошек! <img src=\"https://www.inoreader.com/b/1438160281/1007947455\" style=\"position:absolute; visibility:hidden\">",
    "xxx: А когда сны видишь в окне Youtube это к какому доктору?<br>yyy: Эт смотря с какой вы стороны окна. Так что или др. Веб, или др. Кащенко. <img src=\"https://www.inoreader.com/b/1438160281/1007947455\" style=\"position:absolute; visibility:hidden\">",
    "Пэни: Возвращались из игоры вчера, решили заехать на зимнюю ладогу повтыкать. По дороге зарулили в магаз. Я захожу в него, а на меня тетка, беседующая с продавщицей борзо так: \"Че ты сюда опять притащилась, иди отсюда!\" Я так охреневше: \"Да вообще первый раз в вашем магазе!!!\"<br>Оказалось, я не заметила, как вместе со мной зашла уличная собака, и эта реплика относилась к ней. Но удивилась я в первый момент изрядно :))) <img src=\"https://www.inoreader.com/b/1438160281/1007947455\" style=\"position:absolute; visibility:hidden\">",
    "Сегодня навстречу попались очень молодые, лет 18-19, родители. Они шли с коляской с грудничком и с огромной надувной ватрушкой, такой штукой, чтоб с ледяных горок кататься.<br>Мда, непросто у некоторых заканчивается детство <img src=\"https://www.inoreader.com/b/1438160281/1007947455\" style=\"position:absolute; visibility:hidden\">"
  ]
}