{
  "Items": [
    "<br>Привет, Geektimes! Представляю вашему вниманию одиннадцатую по счету подборку ссылок на материалы о создании контента, маркетинге и Growth Hacks. <br><br><a href=\"http://geektimes.ru/post/245534/\"><img src=\"http://habrastorage.org/getpro/geektimes/post_images/1f7/153/929/1f715392980d90a5e09b3767a1ba7b53.jpg\" alt=\"image\"></a><br><br><i><b>Примечание:</b> предыдущие размещались сначала на Geektimes, позднее по приглашению администрации переехали на Хабр, а затем на Мегамозге — но на новом сайте пока особенно нет читателей, поэтому возвращаемся к истокам.</i><br><br>\r\nСтатьи на английском и видеоматериалы помечаются специальными иконками. <a href=\"http://geektimes.ru/post/245534/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br>Многие владельцы кошек замечали, что их питомцы очень любят залезать в коробки. <br><a href=\"http://geektimes.ru/post/245536/#habracut\">Осторожно, мимимишность этого поста находится вне разумных пределов!</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br>Доброго времени суток!<br><br><img src=\"http://habrastorage.org/files/4b1/5bf/45e/4b15bf45e18f4f54bf4a40274c5163bf.png\"><br><br>\r\nДумаю многих из вас когда-либо посещала мысль о возможности получения статей из избранного в формате PDF для использования в оффлайне (например, в читалке).<br>\r\nТакая же мысль посетила и меня <a href=\"http://habrahabr.ru/post/208802/\">чуть больше года назад</a>. <br>\r\nПредставляю вам новую версию программы закачки статей с Хабра, Гиктаймс и Мегамозг в формате PDF.<br><br>\r\nНовый проект называется <a href=\"https://github.com/icoz/habraparse\">HabraParse</a>.<br>\r\nПроект состоит из библиотечки, которая парсит сайты, и скрипта, использующего лишь часть возможностей этой библиотеки. Скрипт написан на python3, для его работы потребуются модули <strong>docopt</strong>, <strong>requests</strong> и <strong>weasyprint</strong> (все их легко можно установить командой <strong>pip install <em>name</em></strong>).<br>\r\nНа текущий момент в скрипте имеются следующие возможности:<br><ul><li>скачать статью по её ID;</li>\r\n<li>скачать список URL избранного для заданного пользователя;</li>\r\n<li>скачать статьи из избранного в папку в формате PDF или HTML (пока реализация HTML не на высоте, поэтому по умолчанию используется формат PDF, но он работает значительно дольше).</li>\r\n</ul><br><a href=\"http://geektimes.ru/post/245530/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br><a href=\"http://geektimes.ru/company/audiomania/blog/245532/\"><img src=\"http://habrastorage.org/files/0b0/666/d3f/0b0666d3fc334addb855574d6d60340d.jpg\" width=\"700\"></a><br><br>\r\nВ своей последней статье я рассматривал вопрос того, как нужно строить музыкальную теорию на основании эмпирического <a href=\"http://www.ethanhein.com/wp/2013/toward-a-better-music-theory/\">наблюдения</a> за людьми – на базе их вкусов и музыкальных предпочтений. Также для построения музыкальной теории можно попытаться понять, что же происходит у нас в голове. Этот вопрос рассмотрел Дэниел Уилкерсон (Daniel Shawcross Wilkerson) в своей <a href=\"http://arxiv.org/html/1202.4212v1\">статье</a> «Разъяснение гармонии: По пути прогресса к научной теории музыки». Это эссе имеет второе очаровательное старомодное название: <br><br><b>Мажорная гамма, стандартная терминология и различия в восприятии минорных и мажорных трезвучий, которые объясняются основными принципами физики и математики. Несостоятельность теории Гельмгольца, а также обоснование теории Терхардта и других.</b><br><br>\r\nУилкерсон начинает с замечания о том, что книги по теории музыки читаются как медицинские тексты средних веков и «в них полно необоснованных суждений с забавными символами, приукрашенными фразами на латыни». Мы можем писать их понятнее. <a href=\"http://geektimes.ru/post/245532/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br>Что такое человек? Как он думает? Почему иногда он делает так, а иногда по-другому? Человечество не может ответить на все эти вопросы, но при этом хочет создать суперкомпьютер, который будет полноценным человеком. Мы создаем искусственный интеллект (далее — ИИ), мы стараемся создать нечто, что будет таким же умным, как и человек, но при этом не понимаем, как чувствует человек.<br><br>\r\nДа, мы можем описать какие-то чувства через эмоции, но как мы сделаем так, чтобы машина умела не только думать, как человек, но и чувствовать, если мы можем описать, но не можем запрограммировать эмоции? Для этого нам нужно научиться моделировать свои мысли при помощи математики и информатики. Именно эта проблема, проблема моделирования духовных процессов для меня является наиболее привлекательной в изучении ИИ.<br><a href=\"http://geektimes.ru/post/245494/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br>Единый портал госуслуг в Facebook <a href=\"https://www.facebook.com/new.gosuslugi/photos/a.217424094987250.57022.217368344992825/862244507171869/?type=1&theater\">сообщил</a> об участившихся рассылках вредоносного контента, ссылающихся на портал. Их получают как пользователи, зарегистрированные на Госуслугах, так и все остальные. Ссылка в письме на скриншоте ведет на заражённый архив. <br><br>\r\nСообщения приходят с адресов в доменах <a href=\"http://geektimes.ru/users/mail/\">mail</a>.ru, <a href=\"http://geektimes.ru/users/list/\">list</a>.ru, <a href=\"http://geektimes.ru/users/inbox/\">inbox</a>.ru, @bk.ru. Портал сделал запрос в <a href=\"http://geektimes.ru/company/mailru/\">Mail.ru</a>. <br><br>\r\nПортал дал рекомендации пользователям:<br><blockquote>1. Никому и ни при каких обстоятельствах не сообщайте ваш пароль от портала госуслуг.<br>\r\n2. При вводе пароля от портала госуслуг в браузере, всегда проверяйте адрес страницы, на которой вводится пароль. Он непременно должен начинаться с <a href=\"https://esia.gosuslugi.ru/\">esia.gosuslugi.ru/</a>.<br>\r\n3. E-mail сообщения от портала госуслуг приходят только с адресов noreply@gosuslugi.ru и support@gosuslugi.ru.<br>\r\n4. Sms-сообщения от портала госуслуг приходят только от отправителя gosuslugi или номера 0919.<br>\r\n5. Портал госуслуг не высылает пользователям никакие повестки, в том числе требования явиться на судебные заседания.<br>\r\n6. Не открывайте архивы и не запускайте исполняемые файлы, присланные вам неизвестными отправителями. Там могут содержаться вирусы или вредоносные приложения.</blockquote><br><img src=\"https://scontent-b.xx.fbcdn.net/hphotos-xpf1/t31.0-8/10985003_862244507171869_8319939546931483984_o.png\" alt=\"image\"><a href=\"http://geektimes.ru/post/245526/#habracut\"></a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br>Facebook разрабатывает систему распознавания лиц DeepFace, которая сможет узнавать людей даже на фото далеко не портретного качества — вроде тех фотографий, на которые человек попал случайно — как это смог бы сделать другой человек. Только это будет машина.<br><br><img src=\"http://habrastorage.org/files/4c6/d7e/003/4c6d7e0034c94f5a8a4e5ff331dfd9c4.jpg\"><br><a href=\"http://geektimes.ru/post/245522/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br>Я купил электронную книгу в Amazon Store, сын захотел копию. Возиться с DRM не очень то и хотелось, поэтому появилась идея сделать скриншот каждой страницы. Сначала думал перелистывать и делать копию экрана — в результате появился маленький шелл скрипт:<br><a href=\"http://geektimes.ru/post/245520/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br>Ранее я уже приводил вам <a href=\"http://geektimes.ru/post/244083/\">обзор шлема VRD</a> и мои впечатления от контроллера жестов рук LeapMotion в своём блоге.<br>\r\nВ тот раз Leap Motion мне быстро наскучил при использовании на обычном компьютере.<br><br>\r\nВ этой статье хочу поделиться своими впечатлениями от использования Leap Motion совместно со шлемом виртуальной реальности VRD:<br><img src=\"http://habrastorage.org/files/ccf/aec/ca9/ccfaecca99a74f4db610bfde4c8f1d33.JPG\"><br><br>\r\nКонтроллер жестов был установлен на шлем, аналогично Oculus Rift VR и вот что из этого получилось…<br><a href=\"http://geektimes.ru/post/245518/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br>Заметили знакомую иконку с бумажным самолётиком на промо-видео нового Убунтофона?<br><br><img src=\"http://habrastorage.org/files/5d5/480/36d/5d548036d7fb41a8ac6ca1ad3bcd2e1a.png\"><br><a href=\"http://geektimes.ru/post/245516/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br>«Майкрософт» уже тестирует приложение управления документами с помощью голосовых команд «Рабочий ассистент», использующего голосовой помощник (аналог Siri) «Кортану», чтобы открывать, редактировать и шарить документы. Это пока прототип, но источники издания The Verge подтвердили намерения ребят из Редмонда внедрить голосового помощника в мобильные и десктопные версии «Офиса» вскоре.<br><br><img src=\"http://habrastorage.org/files/7c8/85d/fb7/7c885dfb7399477585764b5c9becc2c8.png\"><br><i>Cortana получила имя в честь персонажа из Halo</i><br><a href=\"http://geektimes.ru/post/245514/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br>На днях <a href=\"http://geektimes.ru/post/244778/\">марсоход отпраздновал</a> свой 11 год на поверхности Марса. И несмотря на солидный возраст, самочувствие ровера отличное, что позволило марсоходу взобраться на Cape Tribulation и сделать панораму окрестностей. <br><img src=\"http://habrastorage.org/getpro/geektimes/post_images/06b/ebd/b29/06bebdb2982fd78234e9c78c4c4da3d2.jpg\" alt=\"image\"><br>\r\nПервоначально предполагалось, что марсоход проработает 90 марсианских дней. Но марсоход проработал почти на 10 земных лет больше запланированного. К сожалению, марсоходу осталось «жить» только до 30 сентября. И причина на Земле.<br><a href=\"http://geektimes.ru/post/245512/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br><img src=\"http://habrastorage.org/getpro/geektimes/post_images/916/f79/b0b/916f79b0b1ba757dec151d3396852518.jpg\"><br><br>\r\nПрошло довольно много времени после появления первой информации о том, что Canonical собирается выпустить смартфон на базе Ubuntu. Когда такие новости появились впервые, разработчики говорили о мощном смартфоне, который можно будет использовать и в качестве десктопа — достаточно просто подключить монитор и соответствующие устройства ввода. Конечно, и производительность такого устройства должна была быть довольно солидной. Но, к сожалению, реальность оказалась несколько иной.<br><br>\r\nТелефон <a href=\"https://insights.ubuntu.com/2015/02/06/bqs-new-aquaris-e4-5-ubuntu-edition-the-smartphone-that-puts-content-and-services-at-your-fingertips/\">Aquaris E4.5 Ubuntu Edition</a>, который появится в Европе на следующей неделе по цене в 190 долларов США, не сможет работать в качестве «мобильного декстопа». Это будет бюджетный телефон с кастомизированной Ubuntu в качестве операционной системы. <br><a href=\"http://geektimes.ru/post/245510/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br><img src=\"http://habrastorage.org/getpro/geektimes/post_images/a51/34e/c65/a5134ec6519b32fcc7dab6ba02033e8e.jpg\"><br><br>\r\nУтеря гаджета — всегда плохо, но еще хуже может быть утеря доступа к важной информации, включая пароли и логины к разного рода ресурсам. Потерял ноутбук — подарил все доступы к интернет-банкингу и доменному регистратору тому, кто ноутбук найдет. Информация, к которой получает доступ злоумышленник или тот, кто нашел потерю, зачастую стоит во много раз дороже гаджета. <br><br>\r\nВ принципе, ноутбук худо-бедно можно запаролить, установить программы типа «антивор» и выполнить еще ряд подобных действий. А что делать с облачной операционной системой Chrome OS и хромобуками? На днях администраторы системы получили возможность <a href=\"http://googlechromereleases.blogspot.fr/2015/02/admin-console-update.html\">удаленно лочить устройства</a>. <br><a href=\"http://geektimes.ru/post/245508/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br><img src=\"http://habrastorage.org/files/e21/827/9d9/e218279d93454840afa09528df186442.jpg\"><br><br>\r\nОбщеизвестно, что при работе серверы, особенно мощные, выделяют много тепла. А в дата-центре с тысячами серверов тепла — огромное количество, и его приходится отводить от оборудования. Для этого используются различные способы, но тепло, в большинстве случаев, пропадает впустую. Правда, в некоторых случаях тепловая энергия все же утилизируется, и используется для полезных целей. <br><br>\r\nИменно так дело обстоит в дата-центре компании «Яндекс», который работает в финском городе Мянтсяля. Российская компания <a href=\"http://www.svkk.ru/ru/novosti/razdely_novostej/ekonomika/servernyj_tsentr_yandeksa_v_myantsyalya_obogrevaet_5000_domov.23500.news\">заключила договор</a> с местной энергетической компанией Mäntsälän Sähkö, согласно которому тепло из дата-центра «Яндекса» будет использоваться для обогрева зданий в этом населенном пункте. <br><a href=\"http://geektimes.ru/post/245506/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br><h6><i>Только купив первую электронную книгу в формате EPUB<br>\r\nя понял почему многие до сих пор предпочитают бумажный вариант.</i></h6><br><img src=\"http://habrastorage.org/files/d9e/3c7/d4a/d9e3c7d4a2c842b9afdcb9d255a557d8.png\"><br><b><u>Сначала главное предостережение, ради которого написан пост.<br>\r\nНи в коем случае не закачивайте на свой компьютер/гаджет книгу,<br>\r\n защищённую по технологии DRM в формате EPUB до того,<br>\r\n как не получите Adobe ID и не привяжете его к своему устройству!</u></b><br>\r\nОбщение с очередным потенциальным клиентом вместо выгодного заказа закончилось милой беседой и вопросом с его стороны: “Почему имея такие наработки и такой опыт ты до сих пор не начал полноценный собственный бизнес по внедрению не чужих, а своих идей в жизнь?”. Чтобы наконец найти силы для старта он предложил мне “взорвать свой мозг” с помощью совершенно невероятной книжки про стартапы и даже кинул ссылку на это чудо. Семя попало на удобренную почву и я решил, если не прочесть данный труд, то хотя бы полистать. Не слишком то я уверен в возможности переноса западного опыта в суверенную российскую действительность, но в сегодняшних обстоятельствах всё больше задумываюсь пойти по пути немалой части своих знакомых и начать свой бизнес за бугром, воспользовавшись плодами Глобализации.<br><br>\r\nИтак, я перешёл по ссылке с твёрдым намерением произвести покупку и тут нарвался на свободу выбора. Книжка была доступна аж в двух вариантах: печатном и электронном. Из желания сэкономить и как можно быстрее совершить насилие над собственным мозгом я выбрал второй и решил, в первый раз в жизни, ПРИОБРЕСТИ ЗА ДЕНЬГИ то, что можно скачать в торренте задаром. Оказалось, что на этом пути есть подводные камни и не совсем там где ожидаешь их увидеть. В результате первая покупка может занять куда больше времени чем поход в соседний книжный магазин, а на выходе за свои немалые деньги получишь ограниченный в применении продукт. О том как минимизировать вред от процесса покупки и пойдёт речь под катом. Те кто решится дочитать статью до конца также познакомится с моими мыслями о сегодняшнем положении дел в области продажи электронных книг, а если тема затронет кого то кроме меня то и обсудить её в комментариях.<br><a href=\"http://geektimes.ru/post/245504/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br><img src=\"http://habrastorage.org/getpro/geektimes/post_images/a22/d5d/831/a22d5d8310b2d03799d917f08839d04d.png\" alt=\"image\"><br><br>\r\nОдин из самых активных форков проекта <a href=\"https://en.wikipedia.org/wiki/Popcorn_Time\">Popcorn Time</a>, <a href=\"https://popcorn-time.se/\">popcorn-time.se</a>, задумался о переходе в сеть i2p. Летом прошлого года проект, заботясь об анонимности своих пользователей, проект начал предоставлять им бесплатный VPN, встроенный в приложение. Однако, к настоящему времени возможности провайдера VPN уже исчерпаны из-за большой популярности проекта.<br><a href=\"http://geektimes.ru/post/245502/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br><h3>Четыре человека контролируют 3 % от всей сети Bitcoin</h3><br><iframe width=\"560\" height=\"349\" src=\"https://www.youtube.com/embed/K8kua5B5K3I?wmode=opaque\" frameborder=\"0\" allowfullscreen></iframe><br><br>\r\nВ сельской местности провинции Ляонин на северо-востоке Китая в бывшем здании завода на втором этаже расположена биткойн-ферма, которую под условием нераскрытия местоположения посетили представители журнала Vice. Это всего лишь одна из шести площадок, которыми владеет группа из четырёх человек. Всего на октябрь прошлого года они располагали компьютерной мощью в 8 петахэшей в секунду. Это 3 процента всей сети Bitcoin.<br><a href=\"http://geektimes.ru/post/245498/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br><img src=\"http://habrastorage.org/getpro/geektimes/post_images/348/7a1/b1a/3487a1b1a2886e3c60b06324b3236b45.jpg\" alt=\"image\"><br><br>\r\nШведский центр высоких технологий Epicenter <a href=\"http://www.ibtimes.co.uk/stockholm-office-workers-epicenter-implanted-microchips-pay-their-lunch-1486045\">предложил всем желающим </a>вместо привычных магнитных карточек имплантировать RFID-чипы. Чипом можно пользоваться для прохода в здание и для работы с МФУ. В дальнейшем планируется принимать оплату внутри комплекса со счёта пользователя. Размером чип не более двух рисинок, а имплантируется он в руку между большим и указательным пальцем.<br><a href=\"http://geektimes.ru/post/245496/#habracut\">Читать дальше →</a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">",
    "<br>Пресс-секретарь Роскомнадзора Вадим Ампелонский считает, что анонимные сети являются неким подобием воровского района Хитровка в Москве. Об этом он <a href=\"http://lenta.ru/news/2015/02/06/roskomnadzortor/\">рассказал</a> в разговоре с «Лентой.ру». Ампелонский заявил:<br><br><blockquote>«Был в прошлом и позапрошлом веке в Москве такой район — Хитровка. Криминальное дно, территория обитания социальных отбросов. Почему русская монархия терпела Хитровку в пешей доступности от места, где короновались августейшие? Доподлинно неизвестно, но, видимо, имея всех упырей в одном месте, их легче было контролировать. […] Вот Tor — это глобальная киберХитровка. Созданная и управляемая знамо кем. Как поступила с Хитровкой советская власть? Почитайте у Гиляровского.»</blockquote><br>\r\nСогласно <a href=\"https://ru.wikisource.org/wiki/%CC%EE%F1%EA%E2%E0_%E8_%EC%EE%F1%EA%E2%E8%F7%E8_%28%C3%E8%EB%FF%F0%EE%E2%F1%EA%E8%E9%29/%D5%E8%F2%F0%EE%E2%EA%E0\">очеркам Гиляровского</a>, в двадцатых годах район был зачищен. Позже его переименовали и превратили в общежитие для рабочих.<br><br>\r\nВ четверг председатель комитета Госдумы по информационной политике, информационным технологиям и связи Леонид Левин <a href=\"https://geektimes.ru/post/245376/\">внёс предложение</a> ограничить для пользователей сети доступ к анонимным сетям по типу Tor. По словам Левина, такие меры помогут предотвратить распространение запрещенной информации и разного рода зловредного программного обеспечения. Речь идёт о сервисах, которые позволяют маскировать реальный внешний IP-адрес компьютера в сети Интернет и обходить блокировки запрещённых сайтов: это прокси, VPN, I2P, Tor. В тот же день от Ампелонского <a href=\"https://geektimes.ru/post/245416/\">стало известно</a>, что Роскомнадзор поддерживает идею Левина. Задача блокировок анонимайзеров была названа технически сложной, но решаемой. <a href=\"http://geektimes.ru/post/245486/#habracut\"></a> <img src=\"https://www.inoreader.com/b/1438160281/1011274967\" style=\"position:absolute; visibility:hidden\">"
  ]
}